<?php

namespace database\seeders;

use Core\Generators;

class SeederCatalogData
{
    public function installDefaultSeeders(): string
    {
        return "INSERT INTO catalog (name)" .
            "VALUES ('Сумка')," .
            "('Трусы')," .
            "('Шайба')," .
            "('Раковина')," .
            "('Шорты')," .
            "('Защита лица')," .
            "('Защита запястья')," .
            "('Защита локтя')," .
            "('Защита голени')," .
            "('Защита шеи')," .
            "('Защита горла')," .
            "('Защита плеч')," .
            "('Защита паховая')," .
            "('Костюм')," .
            "('Рубашка')," .
            "('Брюки')," .
            "('Перчатки')," .
            "('Нагрудник')," .
            "('Нижнее белье')," .
            "('Гамаши')," .
            "('Джемпер')," .
            "('Толстовка')," .
            "('Кофта')," .
            "('Свитер')," .
            "('Шлем')," .
            "('Визор')," .
            "('Маска')," .
            "('Куртка')," .
            "('Майка')," .
            "('Футболка')," .
            "('Поло')," .
            "('Пояс')," .
            "('Подтяжки')," .
            "('Ремень')," .
            "('Сандали')," .
            "('Клюшки')," .
            "('Коньки')," .
            "('Ловушка')," .
            "('Блин')," .
            "('Блокер')," .
            "('Щитки')," .
            "('Композитная трубка')," .
            "('Композитная рукоятка')," .
            "('Лопасть композитная')," .
            "('Композитный крюк')," .
            "('Сменная лопасть')," .
            "('Гаситель')," .
            "('Сетка')," .
            "('Стакан')," .
            "('Лезвие')," .
            "('Алмазный корректор')," .
            "('Шнурки')," .
            "('Чехлы')," .
            "('Регулятор')," .
            "('Крепеж')," .
            "('Запасные винты')," .
            "('Разное')," .
            "('Камень для заточки');";
    }

    public function generate(int $count = null): array
    {
        return [];
    }
}

return new SeederCatalogData();
